[
  {
    "title": "Kỷ niệm 80 năm Ngày thành lập Quân đội Nhân dân Việt Nam (22/12/1944 - 22/12/2024)",
    "summary": "Ngày 22/12/2024 đánh dấu 80 năm thành lập Quân đội Nhân dân Việt Nam - lực lượng vũ trang cách mạng do Đảng Cộng sản Việt Nam và Chủ tịch Hồ Chí Minh sáng lập, lãnh đạo và rèn luyện.",
    "content": "## Lịch sử hào hùng 80 năm\n\nNgày 22/12/1944, tại khu rừng Trần Hưng Đạo, huyện Nguyên Bình, tỉnh Cao Bằng, Đội Việt Nam Tuyên truyền Giải phóng quân được thành lập với 34 chiến sĩ, do đồng chí Võ Nguyên Giáp chỉ huy. Đây là tiền thân của Quân đội Nhân dân Việt Nam ngày nay.\n\n## Những mốc son lịch sử\n\n### Chiến thắng Điện Biên Phủ (1954)\n\nSau 56 ngày đêm chiến đấu anh dũng, quân và dân ta đã giành thắng lợi hoàn toàn trong chiến dịch Điện Biên Phủ, buộc thực dân Pháp phải ký Hiệp định Genève, kết thúc cuộc kháng chiến chống Pháp.\n\n### Đại thắng mùa Xuân 1975\n\nChiến dịch Hồ Chí Minh lịch sử đã giải phóng hoàn toàn miền Nam, thống nhất đất nước, kết thúc 30 năm chiến tranh giải phóng dân tộc.\n\n## Quân đội trong thời kỳ mới\n\nNgày nay, Quân đội Nhân dân Việt Nam tiếp tục phát huy truyền thống anh hùng, xây dựng quân đội \"cách mạng, chính quy, tinh nhuệ, từng bước hiện đại\", bảo vệ vững chắc Tổ quốc Việt Nam xã hội chủ nghĩa.\n\n## 10 lời thề danh dự\n\nMỗi quân nhân Quân đội Nhân dân Việt Nam đều thuộc lòng 10 lời thề danh dự, thể hiện ý chí quyết tâm bảo vệ Tổ quốc và phục vụ nhân dân.",
    "slug": "ky-niem-80-nam-thanh-lap-quan-doi-nhan-dan-viet-nam",
    "date": "2024-12-22",
    "tags": ["Quân đội", "Lịch sử", "22/12", "Việt Nam"],
    "images": ["/static/images/github-traffic.png"],
    "draft": false
  },
  {
    "title": "Đại tướng Võ Nguyên Giáp - Người anh cả của Quân đội Nhân dân Việt Nam",
    "summary": "Đại tướng Võ Nguyên Giáp (1911-2013) là vị tướng huyền thoại, người chỉ huy tối cao của Quân đội Nhân dân Việt Nam trong hai cuộc kháng chiến chống Pháp và chống Mỹ.",
    "content": "## Tiểu sử\n\nĐại tướng Võ Nguyên Giáp sinh ngày 25/8/1911 tại làng An Xá, huyện Lệ Thủy, tỉnh Quảng Bình. Ông là một trong những học trò xuất sắc của Chủ tịch Hồ Chí Minh.\n\n## Người sáng lập Quân đội\n\nNgày 22/12/1944, đồng chí Võ Nguyên Giáp được Đảng và Bác Hồ giao nhiệm vụ thành lập Đội Việt Nam Tuyên truyền Giải phóng quân - tiền thân của Quân đội Nhân dân Việt Nam.\n\n## Những chiến thắng lịch sử\n\n### Chiến dịch Điện Biên Phủ\n\nVới tài thao lược xuất sắc, Đại tướng đã chỉ huy quân ta giành thắng lợi trong trận Điện Biên Phủ \"lừng lẫy năm châu, chấn động địa cầu\", được thế giới ca ngợi là \"Người chiến thắng Điện Biên\".\n\n### Cuộc Tổng tiến công và nổi dậy mùa Xuân 1975\n\nĐại tướng Võ Nguyên Giáp đã có những đóng góp quan trọng trong việc hoạch định chiến lược, góp phần quyết định vào thắng lợi cuối cùng.\n\n## Di sản\n\nĐại tướng Võ Nguyên Giáp qua đời ngày 4/10/2013, hưởng thọ 103 tuổi. Ông để lại di sản quý báu về nghệ thuật quân sự và tinh thần yêu nước cho các thế hệ mai sau.\n\n## Danh hiệu\n\n- Đại tướng Quân đội Nhân dân Việt Nam (1948)\n- Anh hùng Lực lượng Vũ trang Nhân dân\n- Huân chương Sao Vàng",
    "slug": "dai-tuong-vo-nguyen-giap-nguoi-anh-ca-quan-doi",
    "date": "2024-11-25",
    "tags": ["Võ Nguyên Giáp", "Đại tướng", "Lịch sử", "Anh hùng"],
    "images": ["/static/images/ocean.jpeg"],
    "draft": false
  },
  {
    "title": "Chiến thắng Điện Biên Phủ - Mốc son chói lọi trong lịch sử dân tộc",
    "summary": "Chiến thắng Điện Biên Phủ ngày 7/5/1954 là một trong những chiến công vĩ đại nhất trong lịch sử chống ngoại xâm của dân tộc Việt Nam, chấm dứt ách thống trị của thực dân Pháp.",
    "content": "## Bối cảnh lịch sử\n\nSau 8 năm kháng chiến chống thực dân Pháp xâm lược (1946-1954), cuộc chiến đấu của quân và dân ta bước vào giai đoạn quyết định. Pháp xây dựng Điện Biên Phủ thành tập đoàn cứ điểm mạnh nhất Đông Dương.\n\n## Lực lượng tham chiến\n\n### Phía Pháp\n- 16.200 quân tinh nhuệ\n- 49 cứ điểm kiên cố\n- 2 sân bay\n- Pháo binh và xe tăng hiện đại\n\n### Phía Việt Nam\n- 4 đại đoàn bộ binh\n- 1 đại đoàn công pháo\n- Hàng vạn dân công hỏa tuyến\n\n## 56 ngày đêm lịch sử\n\nTừ ngày 13/3 đến 7/5/1954, quân và dân ta đã tiến hành cuộc chiến đấu anh dũng qua 3 đợt:\n\n1. **Đợt 1 (13-17/3)**: Tiêu diệt cụm cứ điểm Him Lam, Độc Lập\n2. **Đợt 2 (30/3-30/4)**: Tiến công các cứ điểm phía Đông\n3. **Đợt 3 (1-7/5)**: Tổng công kích, tiêu diệt hoàn toàn tập đoàn cứ điểm\n\n## Chiến thắng lịch sử\n\nChiều 7/5/1954, lá cờ \"Quyết chiến quyết thắng\" tung bay trên nóc hầm De Castries. Tướng De Castries cùng toàn bộ Ban tham mưu bị bắt sống.\n\n## Ý nghĩa\n\nChiến thắng Điện Biên Phủ:\n- Chấm dứt ách thống trị của thực dân Pháp\n- Buộc Pháp ký Hiệp định Genève\n- Cổ vũ phong trào giải phóng dân tộc trên thế giới",
    "slug": "chien-thang-dien-bien-phu-moc-son-lich-su",
    "date": "2024-05-07",
    "tags": ["Điện Biên Phủ", "Lịch sử", "Chiến thắng", "7/5"],
    "images": ["/static/images/canada/mountains.jpg"],
    "draft": false
  },
  {
    "title": "Quân đội Nhân dân Việt Nam - Từ 34 chiến sĩ đến quân đội hiện đại",
    "summary": "Hành trình 80 năm xây dựng và trưởng thành của Quân đội Nhân dân Việt Nam, từ đội quân nhỏ bé ban đầu trở thành lực lượng vũ trang cách mạng hùng mạnh.",
    "content": "## Khởi nguồn\n\nNgày 22/12/1944, Đội Việt Nam Tuyên truyền Giải phóng quân ra đời với vỏn vẹn 34 chiến sĩ, trang bị thô sơ nhưng có một vũ khí mạnh nhất: tinh thần yêu nước và ý chí quyết tâm giành độc lập.\n\n## Các giai đoạn phát triển\n\n### 1944-1954: Kháng chiến chống Pháp\n- Từ 34 chiến sĩ phát triển lên hàng triệu quân\n- Đánh thắng quân đội viễn chinh Pháp\n- Chiến thắng Điện Biên Phủ lịch sử\n\n### 1954-1975: Kháng chiến chống Mỹ\n- Xây dựng quân đội chính quy\n- Đánh thắng đế quốc Mỹ\n- Giải phóng miền Nam, thống nhất đất nước\n\n### 1975-nay: Xây dựng và bảo vệ Tổ quốc\n- Hiện đại hóa quân đội\n- Tham gia gìn giữ hòa bình Liên Hợp Quốc\n- Xây dựng quân đội \"tinh, gọn, mạnh\"\n\n## Quân đội hiện đại\n\nNgày nay, Quân đội Nhân dân Việt Nam được trang bị:\n- Hệ thống phòng không hiện đại\n- Tên lửa đất đối hải\n- Tàu ngầm Kilo\n- Máy bay Su-30MK2\n- Xe tăng T-90\n\n## Sứ mệnh\n\nQuân đội Nhân dân Việt Nam tiếp tục thực hiện sứ mệnh:\n- Bảo vệ độc lập, chủ quyền, thống nhất, toàn vẹn lãnh thổ\n- Bảo vệ Đảng, Nhà nước, nhân dân\n- Tham gia xây dựng đất nước\n- Thực hiện nghĩa vụ quốc tế",
    "slug": "quan-doi-nhan-dan-viet-nam-hanh-trinh-80-nam",
    "date": "2024-12-20",
    "tags": ["Quân đội", "Lịch sử", "Hiện đại hóa", "Việt Nam"],
    "images": ["/static/images/debug-in-nodejs.png"],
    "draft": false
  },
  {
    "title": "Các vị tướng lĩnh xuất sắc của Quân đội Nhân dân Việt Nam",
    "summary": "Điểm qua những vị tướng lĩnh tài ba đã góp phần viết nên những trang sử vẻ vang của Quân đội Nhân dân Việt Nam qua các thời kỳ.",
    "content": "## Các Đại tướng của Quân đội\n\n### 1. Đại tướng Võ Nguyên Giáp (1911-2013)\n- Đại tướng đầu tiên của Quân đội\n- Tổng Tư lệnh, Bộ trưởng Bộ Quốc phòng\n- Người chỉ huy chiến thắng Điện Biên Phủ\n\n### 2. Đại tướng Nguyễn Chí Thanh (1914-1967)\n- Đại tướng thứ hai của Quân đội\n- Chủ nhiệm Tổng cục Chính trị đầu tiên\n- Bí thư Trung ương Cục miền Nam\n\n### 3. Đại tướng Văn Tiến Dũng (1917-2002)\n- Tổng Tham mưu trưởng\n- Tư lệnh chiến dịch Hồ Chí Minh\n- Bộ trưởng Bộ Quốc phòng\n\n### 4. Đại tướng Chu Huy Mân (1913-2006)\n- Chủ nhiệm Tổng cục Chính trị\n- Phó Chủ tịch Hội đồng Nhà nước\n\n### 5. Đại tướng Lê Đức Anh (1920-2019)\n- Bộ trưởng Bộ Quốc phòng\n- Chủ tịch nước CHXHCN Việt Nam\n\n## Các Anh hùng tiêu biểu\n\n- **Phan Đình Giót**: Lấy thân mình lấp lỗ châu mai\n- **Tô Vĩnh Diện**: Anh hùng lấy thân chèn pháo\n- **Bế Văn Đàn**: Lấy thân làm giá súng\n- **Nguyễn Viết Xuân**: \"Nhằm thẳng quân thù mà bắn\"\n\n## Di sản\n\nCác vị tướng lĩnh đã để lại di sản quý báu về:\n- Nghệ thuật quân sự Việt Nam\n- Tinh thần \"Bộ đội Cụ Hồ\"\n- Truyền thống đoàn kết quân dân",
    "slug": "cac-tuong-linh-xuat-sac-quan-doi-nhan-dan-viet-nam",
    "date": "2024-12-15",
    "tags": ["Tướng lĩnh", "Anh hùng", "Lịch sử", "Quân đội"],
    "images": ["/static/images/google.png"],
    "draft": false
  },
  {
    "title": "Quân đội Việt Nam tham gia lực lượng gìn giữ hòa bình Liên Hợp Quốc",
    "summary": "Việt Nam đã cử hàng trăm sĩ quan và quân nhân tham gia các phái bộ gìn giữ hòa bình của Liên Hợp Quốc, thể hiện trách nhiệm với cộng đồng quốc tế.",
    "content": "## Tham gia gìn giữ hòa bình\n\nTừ năm 2014, Việt Nam chính thức cử lực lượng tham gia các hoạt động gìn giữ hòa bình của Liên Hợp Quốc, đánh dấu bước tiến quan trọng trong hội nhập quốc tế về quốc phòng.\n\n## Các phái bộ\n\n### Phái bộ UNMISS (Nam Sudan)\n- Bệnh viện dã chiến cấp 2\n- Đội công binh\n- Sĩ quan tham mưu\n\n### Phái bộ UNISFA (Abyei)\n- Sĩ quan liên lạc\n- Quan sát viên quân sự\n\n### Phái bộ khác\n- MINURSO (Tây Sahara)\n- MINUSCA (Trung Phi)\n\n## Thành tựu nổi bật\n\n- Triển khai 2 bệnh viện dã chiến cấp 2 tại Nam Sudan\n- Hàng trăm lượt sĩ quan hoàn thành nhiệm vụ\n- Được Liên Hợp Quốc đánh giá cao\n- Xây dựng hình ảnh \"Bộ đội Cụ Hồ\" trên trường quốc tế\n\n## Bệnh viện dã chiến\n\nBệnh viện dã chiến cấp 2 của Việt Nam:\n- 63 giường bệnh\n- Trang thiết bị hiện đại\n- Nhân viên y tế chuyên nghiệp\n- Khám chữa bệnh cho nhân viên LHQ và người dân địa phương\n\n## Ý nghĩa\n\nViệc tham gia gìn giữ hòa bình:\n- Thể hiện trách nhiệm quốc tế\n- Nâng cao năng lực quân đội\n- Quảng bá hình ảnh Việt Nam\n- Tích lũy kinh nghiệm thực tiễn",
    "slug": "quan-doi-viet-nam-gin-giu-hoa-binh-lien-hop-quoc",
    "date": "2024-11-20",
    "tags": ["Gìn giữ hòa bình", "Liên Hợp Quốc", "Quốc tế", "Quân đội"],
    "images": ["/static/images/canada/lake.jpg"],
    "draft": false
  }
]

